## Exercícios

1. Considere a existência de três tabelas distintas:
* customer.csv : Possui a informação dos clientes em duas colunas: customer id  customer name
* products.csv : Contém informação dos produtos vendidos pela empresa em três colunas - p_id (product id), product (name) e price
* sales.csv : Contém informações das vendas realizadas em seis colunas - sale_id, c_id (customer id), p_id (product_id), qty (quantity sold), store (name)

Conhecendo as bases responda:

a) Quais foram os produtos vendidos?

In [1]:
import pandas as pd
import numpy as np

In [2]:
customer = pd.read_csv('./data/customer.csv', sep=',')

In [3]:
customer

   c_id Customer
0     1     Rabi
1     2     Raju
2     3     Alex
3     4     Rani
4     5     King
5     7     Ronn
6     8      Jem
7     9      Tom

In [4]:
products = pd.read_csv('./data/products.csv', sep=',')

In [5]:
products

   p_id       product  price
0     1     Hard Disk     80
1     2           RAM     90
2     3       Monitor     75
3     4           CPU     55
4     5      Keyboard     20
5     6         Mouse     10
6     7   Motherboard     50
7     8  Power supply     20

In [6]:
sales = pd.read_csv('./data/sales.csv', sep=',')

In [7]:
sales

   sale_id  c_id  p_id  product  qty store
0        1     2     3  Monitor    2   ABC
1        2     2     4      CPU    1   DEF
2        3     1     3  Monitor    3   ABC
3        4     4     2      RAM    2   DEF
4        5     2     3  Monitor    3   ABC
5        6     3     3  Monitor    2   DEF
6        7     2     2      RAM    3   ABC
7        8     3     2      RAM    2   DEF
8        9     2     3  Monitor    2   ABC

In [8]:
products.describe()

          p_id      price
count  8.00000   8.000000
mean   4.50000  50.000000
std    2.44949  30.589447
min    1.00000  10.000000
25%    2.75000  20.000000
50%    4.50000  52.500000
75%    6.25000  76.250000
max    8.00000  90.000000

In [9]:
s = sales['product'].unique()

In [10]:
s

array(['Monitor', 'CPU', 'RAM'], dtype=object)

In [11]:
products[products['product'].isin(s)]

   p_id  product  price
1     2      RAM     90
2     3  Monitor     75
3     4      CPU     55

b) E os não vendidos?

In [12]:
products[~(products['product'].isin(s))]

   p_id       product  price
0     1     Hard Disk     80
4     5      Keyboard     20
5     6         Mouse     10
6     7   Motherboard     50
7     8  Power supply     20

c) Quais foram as cinco maiores vendas? Salve essas vendas em um arquivo excel.

In [13]:
products

   p_id       product  price
0     1     Hard Disk     80
1     2           RAM     90
2     3       Monitor     75
3     4           CPU     55
4     5      Keyboard     20
5     6         Mouse     10
6     7   Motherboard     50
7     8  Power supply     20

In [14]:
sales_value = sales[['product', 'qty']]

In [15]:
list_sales =[]

In [16]:
for q in sales_value.itertuples():
    for v in products.itertuples():
        if q[1] == v[2]:
            list_sales.append(q[2]*v[3])

In [17]:
list_sales

[150, 55, 225, 180, 225, 150, 270, 180, 150]

In [18]:
sales['sales_value'] = list_sales

In [19]:
sales.sort_values('sales_value', ascending=False, inplace=True)

In [20]:
sales[:5]

   sale_id  c_id  p_id  product  qty store  sales_value
6        7     2     2      RAM    3   ABC          270
2        3     1     3  Monitor    3   ABC          225
4        5     2     3  Monitor    3   ABC          225
3        4     4     2      RAM    2   DEF          180
7        8     3     2      RAM    2   DEF          180

In [21]:
from pandas import ExcelWriter
writer = ExcelWriter('top5_sales.xlsx')

In [22]:
sales[:5].to_excel(writer, encoding="utf-8", index = False)
writer.save()

In [23]:
p = pd.read_excel('top5_sales.xlsx')

In [24]:
p

   sale_id  c_id  p_id  product  qty store  sales_value
0        7     2     2      RAM    3   ABC          270
1        3     1     3  Monitor    3   ABC          225
2        5     2     3  Monitor    3   ABC          225
3        4     4     2      RAM    2   DEF          180
4        8     3     2      RAM    2   DEF          180

d) Liste a quantidade vendida de cada produto. Utilize um loop for para isso.

In [25]:
for i in s:
    print(i,sales[sales['product'] == i]['qty'].sum())

Monitor 12
CPU 1
RAM 7

e) Liste a quantidade vendida de cada loja.

In [26]:
st  = sales['store'].unique()

In [27]:
for i in st:
    print(i,sales[sales['store'] == i]['qty'].sum())

ABC 13
DEF 7

f) Liste a quantidade vendida de cada produto por loja.

In [28]:
for st_ in st:
    for p in s:
        print(st_,p,sales[(sales['store'] == st_) & (sales['product'] == p)]['qty'].sum())

ABC Monitor 10
ABC CPU 0
ABC RAM 3
DEF Monitor 2
DEF CPU 1
DEF RAM 4